app/controllers/attachments_controller.rb

INSERT INTO `attachments` (`resource_type`, `content_type`, `thumbnail`, `size`, `updated_at`, `resource_id`, `filename`, `height`, `parent_id`, `width`, `created_at`) VALUES(0, 'image/jpeg', NULL, 57227, '2009-08-15 01:41:02', 5, '4809_92527488467_579733467_1802826_3944353_n.jpg', 453, NULL, 604, '2009-08-15 01:41:02')
---
  def create
    @attachment = @experiment.attachments.new(params[:attachment])

    respond_to do |format|
      if current_user.save_object(@attachment)