app/controllers/experiments_controller.rb

SELECT * FROM `experiments` WHERE (`experiments`.`id` = 5 AND (`experiments`.project_id = 6))
---
  def show
    @experiment = @project.experiments.find(params[:id])

SELECT * FROM `experiments` WHERE (`experiments`.`id` = 1)
---
  def edit
    @experiment = Experiment.find(params[:id])

INSERT INTO `experiments` (`project_id`, `updated_at`, `title`, `description`, `user_id`, `created_at`) VALUES(4, '2009-08-13 06:38:24', 'exp2', 'lksdfksdfsdf', 1, '2009-08-13 06:38:24')
---
  def create
    @experiment = @project.experiments.new(params[:experiment].merge({ :user_id => current_user.id }))
    respond_to do |format|
      if current_user.save_object(@experiment)

SELECT * FROM `experiments` WHERE (`experiments`.`id` = 1 AND (`experiments`.project_id = 4))
UPDATE `experiments` SET `description` = 'we want to turn it on and see if it eats the world.<br><br>But what if it doesn\'t?', `updated_at` = '2009-08-14 05:01:53' WHERE `id` = 5
---
  def update
    @experiment = @project.experiments.find(params[:id])

    respond_to do |format|
      if @experiment.update_attributes(params[:experiment])