app/controllers/notes_controller.rb

  def create
    @note = @experiment.notes.new(params[:note])

    respond_to do |format|
      if @note.save
        @page_item = current_user.todays_page.page_items.new
        @page_item.resource = @note
        @page_item.save
---
INSERT INTO `notes` (`experiment_id`, `updated_at`, `title`, `body`, `created_at`) VALUES(2, '2009-08-13 06:51:38', 'note number sodjlkj', 'lasdlkh adskjh skdjhfas', '2009-08-13 06:51:38')
INSERT INTO `page_items` (`resource_type`, `updated_at`, `page_id`, `resource_id`, `created_at`) VALUES('Note', '2009-08-13 07:22:57', NULL, 3, '2009-08-13 07:22:57')
INSERT INTO `pages` (`page_date`, `user_id`) VALUES(NULL, 1)