app/controllers/pages_controller.rb

  def index
    @pages = current_user.pages.all
---
SELECT * FROM `pages` WHERE (`pages`.user_id = 1) ORDER BY page_date DESC

  def show
    if params[:date] == 'today'
      @page = current_user.todays_page
    else
      @page = current_user.pages.find_by_page_date(params[:date])
---
SELECT * FROM `pages` WHERE (`pages`.`page_date` = '2009-08-13') AND (`pages`.user_id = 1) ORDER BY page_date DESC LIMIT 1

  def notebook
    @pages = current_user.pages.find(:all, :order => ["page_date ASC"])
---
SELECT * FROM `pages` WHERE (`pages`.user_id = 1) ORDER BY page_date ASC, page_date DESC