app/controllers/projects_controller.rb

INSERT INTO `projects` (`updated_at`, `title`, `description`, `owner_id`, `created_at`) VALUES('2009-08-15 20:12:27', 'Why the sky is blue', 'We must figure out why the sky is blue.<div><br></div><div>It can\'t be that complicated.</div><div><br></div><div>Can it?</div>', 2, '2009-08-15 20:12:27')
---
  def create
    @project = Project.new(params[:project].merge({ :owner_id => current_user.id }))

    respond_to do |format|
      if current_user.save_object(@project)

SELECT * FROM `projects` WHERE (`projects`.`id` = 6)
SELECT `projects`.id FROM `projects` INNER JOIN `projects_users` ON `projects`.id = `projects_users`.project_id WHERE (`projects`.`id` = 6) AND (`projects_users`.user_id = 2 ) LIMIT 1
---
  def add_me
    @project = Project.find(params[:id])
    current_user.projects << @project unless current_user.projects.include?(@project)