app/controllers/users_controller.rb

  def index
    @projects = Project.find(:all, :include => [:users])
---
SELECT * FROM `projects` INNER JOIN `projects_users` ON `projects`.id = `projects_users`.project_id WHERE (`projects_users`.user_id = 1 )
SELECT * FROM `users` INNER JOIN `projects_users` ON `users`.id = `projects_users`.user_id WHERE (`projects_users`.project_id = 4 )